Tekla.Structures.ModelInternal.dotModelInfoModeEnum
The model info mode enum

Tekla.Structures.ModelInternal.dotModelInfoModeEnum.GetModelInfo
Get model info

Tekla.Structures.ModelInternal.dotModelInfoModeEnum.OpenModel
Open model

Tekla.Structures.ModelInternal.dotModelInfoModeEnum.CloseModel
Close model